import React, { useState } from 'react'

export const Timetable: React.FunctionComponent = () => {
    return (
        <div className="container p-0">
            <div className="table-responsive">
                <table className="table">
                    <thead className="table-dark">
                        <tr>
                            <th scope="col" className="">Пара<br />Время</th>
                            <th scope="col" className="">1-я<br />08:30-09:50</th>
                            <th scope="col" className="">2-я<br />10:00-11:20</th>
                            <th scope="col" className="">3-я<br />11:30-12:50</th>
                            <th scope="col" className="">4-я<br />13:30-14:50</th>
                            <th scope="col" className="">5-я<br />15:00-16:20</th>
                            <th scope="col" className="">6-я<br />16:30-17:50</th>
                            <th scope="col" className="">7-я<br />18:00-19:20</th>
                            <th scope="col" className="">8-я<br />19:30-20:50</th>
                        </tr>
                    </thead>
                    <tbody className="">
                        <tr className="table-active">
                            <th scope="row">Пнд</th>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                        </tr>
                        <tr>
                            <th scope="row">Втр</th>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                        </tr>
                        <tr>
                            <th scope="row">Срд</th>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                        </tr>
                        <tr>
                            <th scope="row">Чтв</th>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                        </tr>
                        <tr>
                            <th scope="row">Птн</th>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                        </tr>
                        <tr>
                            <th scope="row">Сбт</th>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                            <td>
                                ПИбд-11
                                Лаб.Объектно-ориентированное программирование- 1 п/г
                                Эгов Е Н
                                3-431
                                ПИбд-11
                                Алгоритмы и структуры данных- 2 п/г
                                Гуськов Г Ю
                                3-429
                            </td>
                        </tr>
                    </tbody>
                </table>
            </div>
        </div>
    );
}